patrickstreit/STM32CubeN6/Projects/STM32N6570-DK/Applications/VENC/VENC_SDCard_ThreadX/Appli/Core/Src/csi_probe.c
/**
  ******************************************************************************
  * @file    csi_probe.c
  * @brief   MIPI CSI-2 receiver probe - see csi_probe.h for the rationale.
  *
  * Everything here is polled and CSI-only. The CSI interrupt is masked while a
  * measurement runs: with a wrong bitrate the receiver raises one error per
  * packet, and with the HAL handler attached that is an interrupt storm which
  * starves the console before the probe can report anything.
  ******************************************************************************
  */

#include "csi_probe.h"

#include <stdio.h>
#include <string.h>

#include "stm32n6570_discovery.h"
#include "stm32n6570_discovery_camera.h"

extern DCMIPP_HandleTypeDef hcamera_dcmipp;

/* Time for the D-PHY to settle after HAL_DCMIPP_CSI_SetConfig() took it through
   reset. Flags latched during that transition say nothing about the link, so
   they are cleared afterwards rather than reported. */
#define CSI_PHY_SETTLE_MS   5U

/* How long to wait for the source to start transmitting. These are timeouts, not
   delays: the wait ends as soon as the receiver reports a high-speed clock.
   Guessing a fixed delay is not an option - too short and every measurement
   afterwards silently characterises a dead link, which is exactly what a 600 ms
   guess did on the first hardware run.
   Driven from the board, the FPGA source measured 6 to 8 seconds to reload its
   configuration. Power-cycled by hand it takes as long as it takes, and the
   operator needs a few seconds on the supply before that even begins. */
#define CSI_SOURCE_AUTO_TIMEOUT_MS    15000U
#define CSI_SOURCE_MANUAL_TIMEOUT_MS  90000U

/* After the clock appears, the lanes still have to synchronise and the first
   frame has to start. */
#define CSI_SOURCE_SYNC_GRACE_MS        300U

/* Bitrate of every HAL DCMIPP_CSI_PHY_BT_xxx profile, in profile order. */
static const uint16_t csi_phy_profile_mbps[] =
{
    80,   90,  100,  110,  120,  130,  140,  150,  160,  170,  180,  190,
   205,  220,  235,  250,  275,  300,  325,  350,  400,  450,  500,  550,
   600,  650,  700,  750,  800,  850,  900,  950, 1000, 1050, 1100, 1150,
  1200, 1250, 1300, 1350, 1400, 1450, 1500, 1550, 1600, 1650, 1700, 1750,
  1800, 1850, 1900, 1950, 2000, 2050, 2100, 2150, 2200, 2250, 2300, 2350,
  2400, 2450, 2500
};
#define CSI_PHY_PROFILE_COUNT (sizeof(csi_phy_profile_mbps) / sizeof(csi_phy_profile_mbps[0]))

/* Coarse sweep grid. A D-PHY profile covers a frequency band rather than a
   point, so this ladder finds the region and the caller can refine around the
   winner. 1250 is in the list because it is the per-lane rate of a 2500 Mbit/s
   two-lane link, which is what this board is wired to. */
static const uint16_t csi_scan_mbps[] =
{
  200, 400, 600, 800, 1000, 1100, 1200, 1250, 1300, 1400, 1500, 1600,
  1700, 1800, 1900, 2000, 2100, 2200, 2300, 2400, 2500
};
#define CSI_SCAN_MBPS_COUNT (sizeof(csi_scan_mbps) / sizeof(csi_scan_mbps[0]))

/* Known-good starting point: the setting the encoder application uses. */
const csi_probe_phy_t csi_probe_default_phy = { .mbps = 1250U, .lanes = 2U, .swapped = 0U };

/* Manual by default: the source may well be on a bench supply, with no line back
   to the board for BSP_CAMERA_HwReset() to pull. */
static csi_source_mode_t g_source_mode = CSI_SOURCE_MANUAL;

/* What the D-PHY is currently programmed with, and whether the last apply
   actually reprogrammed it. Together they keep the probe from asking for a
   power-cycle it does not need. mbps 0 means "nothing applied yet". */
static csi_probe_phy_t g_applied_phy;
static bool            g_phy_reapplied;

static const uint32_t vc_start_bit[CSI_PROBE_VC_COUNT] =
{ CSI_CR_VC0START, CSI_CR_VC1START, CSI_CR_VC2START, CSI_CR_VC3START };

static const uint32_t vc_stop_bit[CSI_PROBE_VC_COUNT] =
{ CSI_CR_VC0STOP, CSI_CR_VC1STOP, CSI_CR_VC2STOP, CSI_CR_VC3STOP };

/* CSI_SR0 error bits that mean "the link is not decoding cleanly". */
#define CSI_SR0_LINK_ERRORS  (CSI_SR0_CRCERRF | CSI_SR0_ECCERRF | CSI_SR0_SYNCERRF | \
                              CSI_SR0_SPKTERRF | CSI_SR0_WDERRF)

/* CSI_SR1 error bits that mean "the D-PHY is not locked at this bitrate". */
#define CSI_SR1_PHY_ERRORS   (CSI_SR1_ESOTDL0F | CSI_SR1_ESOTSYNCDL0F | CSI_SR1_EESCDL0F | \
                              CSI_SR1_ESYNCESCDL0F | CSI_SR1_ECTRLDL0F | \
                              CSI_SR1_ESOTDL1F | CSI_SR1_ESOTSYNCDL1F | CSI_SR1_EESCDL1F | \
                              CSI_SR1_ESYNCESCDL1F | CSI_SR1_ECTRLDL1F)

/* ------------------------------------------------------------------------- */
/* Data type helpers                                                         */
/* ------------------------------------------------------------------------- */

const char *csi_probe_dt_name(uint32_t dt)
{
  switch (dt)
  {
    case 0x00U: return "FRAME_START";
    case 0x01U: return "FRAME_END";
    case 0x02U: return "LINE_START";
    case 0x03U: return "LINE_END";
    case 0x08U: return "GENERIC_SHORT";
    case 0x10U: return "NULL";
    case 0x11U: return "BLANKING";
    case 0x12U: return "EMBEDDED";
    case DCMIPP_DT_YUV420_8:  return "YUV420_8";
    case DCMIPP_DT_YUV420_10: return "YUV420_10";
    case DCMIPP_DT_YUV422_8:  return "YUV422_8";
    case DCMIPP_DT_YUV422_10: return "YUV422_10";
    case DCMIPP_DT_RGB444:    return "RGB444";
    case DCMIPP_DT_RGB555:    return "RGB555";
    case DCMIPP_DT_RGB565:    return "RGB565";
    case DCMIPP_DT_RGB666:    return "RGB666";
    case DCMIPP_DT_RGB888:    return "RGB888";
    case DCMIPP_DT_RAW8:      return "RAW8";
    case DCMIPP_DT_RAW10:     return "RAW10";
    case DCMIPP_DT_RAW12:     return "RAW12";
    case DCMIPP_DT_RAW14:     return "RAW14";
    default:                  return "?";
  }
}

uint32_t csi_probe_dt_bpp(uint32_t dt)
{
  switch (dt)
  {
    case DCMIPP_DT_RAW8:      return 8U;
    case DCMIPP_DT_RAW10:     return 10U;
    case DCMIPP_DT_RAW12:     return 12U;
    case DCMIPP_DT_RAW14:     return 14U;
    case DCMIPP_DT_YUV420_8:  return 12U;
    case DCMIPP_DT_YUV422_8:  return 16U;
    case DCMIPP_DT_YUV422_10: return 20U;
    case DCMIPP_DT_RGB565:    return 16U;
    case DCMIPP_DT_RGB888:    return 24U;
    default:                  return 0U;
  }
}

