patrickstreit/STM32CubeN6/Projects/STM32N6570-DK/Applications/VENC/VENC_SDCard_ThreadX/Appli/Core/Src/csi_probe.c
void csi_probe_datatypes(uint32_t vc, uint32_t window_ms, csi_probe_vc_info_t *info)
{
  /* static: keeps ~150 bytes off a thread stack that is only 4 kB. */
  static uint32_t id_err[CSI_DT_CANDIDATE_COUNT];
  static bool     lb_hit[CSI_DT_CANDIDATE_COUNT];
  uint32_t accepted = 0U;
  uint32_t quietest = 0U;
  uint32_t best_idx = 0U;
  uint32_t per_dt_ms;
  bool     found    = false;

  if ((info == NULL) || (vc >= CSI_PROBE_VC_COUNT))
  {
    return;
  }

  info->dt_mask_lo     = 0U;
  info->dt_mask_hi     = 0U;
  info->image_dt       = 0U;
  info->image_dt_count = 0U;
  info->dt_corrupt     = 0U;

  /* Enough for several frame periods per candidate, so "no data" means absence
     rather than a window that happened to fall into vertical blanking. */
  per_dt_ms = window_ms / 2U;
  if (per_dt_ms < 100U)
  {
    per_dt_ms = 100U;
  }

  HAL_NVIC_DisableIRQ(CSI_IRQn);

  for (uint32_t i = 0U; i < CSI_DT_CANDIDATE_COUNT; i++)
  {
    dt_trial(vc, csi_dt_candidates[i], per_dt_ms, &lb_hit[i], &id_err[i]);
  }

  /* Leave the channel accepting everything again, so nothing downstream trips
     over a filter the probe left behind. */
  (void)HAL_DCMIPP_CSI_SetVCConfig(&hcamera_dcmipp, vc, DCMIPP_CSI_DT_BPP8);
  HAL_NVIC_EnableIRQ(CSI_IRQn);

  /* The whole table, not a summary. A summary is what hid the fact that the
     previous method only ever saw a single value. */
  printf("CSI: VC%lu data type walk, %lu ms per candidate\n",
         (unsigned long)vc, (unsigned long)per_dt_ms);
  printf("        DT   name          data  rejected\n");
  for (uint32_t i = 0U; i < CSI_DT_CANDIDATE_COUNT; i++)
  {
    printf("       0x%02x  %-12s  %-4s  %lu\n",
           (unsigned)csi_dt_candidates[i],
           csi_probe_dt_name(csi_dt_candidates[i]),
           lb_hit[i] ? "yes" : "-",
           (unsigned long)id_err[i]);

    if (lb_hit[i])
    {
      uint32_t dt = csi_dt_candidates[i];

      accepted++;
      if (dt < 32U)
      {
        info->dt_mask_lo |= (1UL << dt);
      }
      else
      {
        info->dt_mask_hi |= (1UL << (dt - 32U));
      }
      if (!found || (id_err[i] < id_err[best_idx]))
      {
        best_idx = i;
        found    = true;
      }
    }
    if (id_err[i] < id_err[quietest])
    {
      quietest = i;
    }
  }

  info->image_dt_count = accepted;

  if (accepted == 1U)
  {
    info->image_dt = csi_dt_candidates[best_idx];
    printf("CSI: VC%lu carries 0x%02lx (%s) - the only type the datapath accepted\n",
           (unsigned long)vc, (unsigned long)info->image_dt,
           csi_probe_dt_name(info->image_dt));
  }
  else if (accepted == 0U)
  {
    /* Either nothing is arriving, or the line/byte counter is not gated by the
       data type filter and therefore says nothing. Fall back to the rejection
       rate and label the answer as the weaker evidence it is. */
    info->image_dt = csi_dt_candidates[quietest];
    printf("CSI: VC%lu no candidate let data through; falling back to the lowest\n"
           "     rejection count, 0x%02lx (%s) - treat this as a guess\n",
           (unsigned long)vc, (unsigned long)info->image_dt,
           csi_probe_dt_name(info->image_dt));
  }
  else
  {
    info->image_dt   = csi_dt_candidates[best_idx];
    info->dt_corrupt = accepted - 1U;
    printf("CSI: VC%lu %lu candidates accepted data; picking 0x%02lx (%s), the one\n"
           "     that rejected fewest packets\n",
           (unsigned long)vc, (unsigned long)accepted,
           (unsigned long)info->image_dt, csi_probe_dt_name(info->image_dt));
    if (accepted == CSI_DT_CANDIDATE_COUNT)
    {
      printf("     every candidate accepted, so the counter is not filtered by\n"
             "     data type and this column proves nothing\n");
    }
  }
}

/* ------------------------------------------------------------------------- */
/* Geometry                                                                  */
/* ------------------------------------------------------------------------- */

/**
  * @brief  Does virtual channel @p vc reach (@p line, @p byte) inside one frame?
  * @note   Uses CSI line/byte counter 0, which only raises a status flag. No
  *         DCMIPP pipe is involved, so an unknown resolution cannot overrun any
  *         buffer - that is the whole reason the geometry is measured this way.
  */
static bool csi_reaches(uint32_t vc, uint32_t line, uint32_t byte, uint32_t timeout_ms)
{
  DCMIPP_CSI_LineByteCounterConfTypeDef cnt = {0};
  uint32_t tickstart;
  bool     reached = false;

  cnt.VirtualChannel = vc;
  cnt.LineCounter    = line;
  cnt.ByteCounter    = byte;
  (void)HAL_DCMIPP_CSI_SetLineByteCounterConfig(&hcamera_dcmipp, DCMIPP_CSI_COUNTER0, &cnt);

  /* Enable the counter but not its interrupt: the flag is polled. */
  SET_BIT(CSI->PRGITR, CSI_PRGITR_LB0EN);
  CSI->FCR0 = CSI_SR0_LB0F;

  tickstart = HAL_GetTick();
  while ((HAL_GetTick() - tickstart) < timeout_ms)
  {
    if ((CSI->SR0 & CSI_SR0_LB0F) != 0U)
    {
      reached = true;
      break;
    }
  }

  CLEAR_BIT(CSI->PRGITR, CSI_PRGITR_LB0EN);
  CSI->FCR0 = CSI_SR0_LB0F;

  return reached;
}

/* Byte 1 rather than byte 0 on both axes. Whether a byte count of zero ever
   counts as reached is not documented, and using one convention for both
   searches at least makes the two comparable. */
static bool probe_line(uint32_t vc, uint32_t value, uint32_t timeout_ms)
{
  return csi_reaches(vc, value, 1U, timeout_ms);
}

static bool probe_byte(uint32_t vc, uint32_t value, uint32_t timeout_ms)
{
  /* Line 1, so the byte counter refers to bytes inside a single line. */
  return csi_reaches(vc, 1U, value, timeout_ms);
}

/**
  * @brief  Largest value in [1, @p hi] for which @p reached still fires.
  * @note   Only exact if "reaches N" is monotonic in N, which geom_verify()
  *         checks afterwards rather than assuming.
  */
static uint32_t csi_search_max(uint32_t vc, uint32_t hi, uint32_t timeout_ms,
                               bool (*reached)(uint32_t vc, uint32_t value, uint32_t timeout_ms))
{
  uint32_t lo   = 1U;
  uint32_t best = 0U;

