patrickstreit/STM32CubeN6/Projects/STM32N6570-DK/Applications/VENC/VENC_SDCard_ThreadX/Appli/Core/Src/csi_probe.c
  while (lo <= hi)
  {
    uint32_t mid = lo + ((hi - lo) / 2U);

    if (reached(vc, mid, timeout_ms))
    {
      best = mid;
      lo   = mid + 1U;
    }
    else
    {
      if (mid == 0U)
      {
        break;
      }
      hi = mid - 1U;
    }
  }
  return best;
}

/**
  * @brief  Check a search result against the assumption the search rests on.
  * @retval true if the four probe points are consistent with monotonicity
  *
  * The binary search is only meaningful if "reaches N" is monotonic in N. When
  * the counter fires on something else - a rate, a wrap-around, a value that is
  * never reached at all - the search still returns a number, and that number is
  * indistinguishable from a measurement. Four extra probes cost a few frame
  * periods and turn it into a claim that can visibly fail.
  */
static bool geom_verify(uint32_t vc, uint32_t best, uint32_t timeout_ms,
                        bool (*reached)(uint32_t vc, uint32_t value, uint32_t timeout_ms),
                        const char *what)
{
  bool at_one;
  bool at_half;
  bool at_best;
  bool past;
  bool ok;

  if (best == 0U)
  {
    printf("CSI:   %s: not even 1 was reached - the counter never fired\n", what);
    return false;
  }

  at_one  = reached(vc, 1U, timeout_ms);
  at_half = reached(vc, (best / 2U) + 1U, timeout_ms);
  at_best = reached(vc, best, timeout_ms);
  past    = reached(vc, best + 1U, timeout_ms);
  ok      = at_one && at_half && at_best && (!past);

  printf("CSI:   %s = %lu   [1:%s  %lu:%s  %lu:%s  %lu:%s]\n",
         what, (unsigned long)best,
         at_one ? "y" : "N",
         (unsigned long)((best / 2U) + 1U), at_half ? "y" : "N",
         (unsigned long)best,               at_best ? "y" : "N",
         (unsigned long)(best + 1U),        past    ? "Y" : "n");

  if (!ok)
  {
    printf("CSI:   ^ not monotonic, so this number is not a measurement\n");
  }
  return ok;
}

void csi_probe_geometry(uint32_t vc, csi_probe_vc_info_t *info)
{
  /* Several frame periods, so a miss is a real miss rather than a window that
     fell between two frames. */
  const uint32_t timeout_ms = 120U;
  uint32_t bpp;
  bool     lines_ok;
  bool     bytes_ok;

  if ((info == NULL) || (vc >= CSI_PROBE_VC_COUNT))
  {
    return;
  }

  info->lines          = 0U;
  info->bytes_per_line = 0U;
  info->width          = 0U;

  HAL_NVIC_DisableIRQ(CSI_IRQn);
  csi_stop_all_vc();
  (void)HAL_DCMIPP_CSI_SetVCConfig(&hcamera_dcmipp, vc, csi_probe_dt_bpp_code(info->image_dt));

  if (!csi_start_vc(vc, 150U))
  {
    printf("CSI: VC%lu did not report the active state; measuring anyway\n", (unsigned long)vc);
  }

  info->lines          = csi_search_max(vc, 0xFFFFU, timeout_ms, probe_line);
  info->bytes_per_line = csi_search_max(vc, 0xFFFFU, timeout_ms, probe_byte);

  printf("CSI: VC%lu geometry, counter 0 reading the channel as %s\n", (unsigned long)vc,
         (csi_probe_dt_bpp(info->image_dt) != 0U) ? "the identified format"
                                                  : "8 bpp (format unknown)");
  lines_ok = geom_verify(vc, info->lines, timeout_ms, probe_line, "lines     ");
  bytes_ok = geom_verify(vc, info->bytes_per_line, timeout_ms, probe_byte, "bytes/line");

  csi_stop_all_vc();
  HAL_NVIC_EnableIRQ(CSI_IRQn);

  /* A number that failed its own check is worse than no number: it looks like a
     resolution and would be used as one. */
  if (!lines_ok)
  {
    info->lines = 0U;
  }
  if (!bytes_ok)
  {
    info->bytes_per_line = 0U;
  }

  bpp = csi_probe_dt_bpp(info->image_dt);
  if ((bpp != 0U) && (info->bytes_per_line != 0U))
  {
    info->width = (info->bytes_per_line * 8U) / bpp;
  }
}

/* ------------------------------------------------------------------------- */
/* Full run and report                                                       */
/* ------------------------------------------------------------------------- */

void csi_probe_report_invalidate(csi_probe_report_t *report)
{
  if (report != NULL)
  {
    memset(report, 0, sizeof(*report));
  }
}

void csi_probe_run(csi_probe_phy_t *phy, csi_probe_report_t *report)
{
  csi_probe_result_t   result;
  csi_probe_vc_info_t *info;
  const uint32_t       window_ms = 500U;

  if ((phy == NULL) || (report == NULL))
  {
    return;
  }

  /* Cleared up front: a run that bails out half way must not leave the previous
     one's numbers behind to be reprinted later. */
  csi_probe_report_invalidate(report);
  info = report->vc;

  if (phy->mbps == 0U)
  {
    /* Try the setting the encoder application uses before sweeping: a sweep
       costs a source restart per combination, and this is very often the answer.
       The restart is what makes it work at all - the transmitter has to come up
       after the receiver, and every bitrate change resets the receiver. */
    csi_probe_phy_t candidate = csi_probe_default_phy;

    printf("CSI: trying the known-good setting first (%u Mbit/s, %u lanes)\n",
           (unsigned)candidate.mbps, (unsigned)candidate.lanes);

    if (csi_probe_wait_for_link(&candidate, 0U))
    {
      *phy = candidate;
    }
    else if (!csi_probe_scan(150U, true, phy))
    {
      return;
    }
  }

  /* Re-measure the chosen setting over a longer window so the per-channel frame
     rate is worth printing. */
  (void)csi_probe_observe(phy, window_ms, true, &result);

  if (result.source_boot_ms == 0U)
  {
    printf("CSI: the source never started; nothing to characterise\n");
    return;
  }
  printf("CSI: source transmitting %lu ms after its restart\n",
         (unsigned long)(result.source_boot_ms - 1U));

  report->phy           = *phy;
  report->link          = result;
  report->link_measured = true;
  report->valid         = true;

  for (uint32_t vc = 0U; vc < CSI_PROBE_VC_COUNT; vc++)
  {
    info[vc].frames  = result.eof[vc];
    info[vc].present = (result.eof[vc] != 0U);
    info[vc].fps_x10 = (result.eof[vc] * 10000U) / window_ms;

    if (!info[vc].present)
    {
      continue;
    }

    csi_probe_datatypes(vc, 150U, &info[vc]);
    csi_probe_geometry(vc, &info[vc]);
  }

  /* Leave each present channel configured for the format it actually carries.
     The D-PHY is deliberately not re-applied here: it already holds this setting
     and the link is up, so touching it would reset the receiver and cost another
     power-cycle for no gain. Only the per-channel format registers are written,
     which the transmitter never sees. */
  for (uint32_t vc = 0U; vc < CSI_PROBE_VC_COUNT; vc++)
  {
    if (info[vc].present)
    {
      (void)HAL_DCMIPP_CSI_SetVCConfig(&hcamera_dcmipp, vc,
                                       csi_probe_dt_bpp_code(info[vc].image_dt));
    }
  }
}

void csi_probe_print_report(const csi_probe_report_t *report, const csi_probe_phy_t *current)
{
  const csi_probe_vc_info_t *info;
  const csi_probe_phy_t     *phy;

  if (report == NULL)
  {
    return;
  }

