patrickstreit/STM32CubeN6/Projects/STM32N6570-DK/Applications/VENC/VENC_SDCard_ThreadX/Appli/Core/Src/csi_probe.c
  if (!report->valid)
  {
    printf("CSI: nothing measured yet - run 'probe'\n");
    return;
  }

  info = report->vc;
  phy  = &report->phy;

  printf("\n=== CSI-2 probe result ===\n");
  printf("D-PHY : %u Mbit/s per lane, %u lane(s), %s mapping\n",
         (unsigned)phy->mbps, (unsigned)phy->lanes,
         (phy->swapped != 0U) ? "inverted" : "physical");

  /* The setting printed above is the one these numbers were taken at, not
     whatever the receiver holds now. Say so when they have drifted apart. */
  if ((current != NULL) &&
      ((current->mbps != phy->mbps) || (current->lanes != phy->lanes) ||
       (current->swapped != phy->swapped)))
  {
    printf("        (the receiver now holds %u Mbit/s, %u lane(s), %s mapping;\n"
           "         these numbers are from the setting above - rerun 'probe')\n",
           (unsigned)current->mbps, (unsigned)current->lanes,
           (current->swapped != 0U) ? "inverted" : "physical");
  }

  if (!report->link_measured)
  {
    printf("Link  : not measured in this run\n");
  }
  else if ((report->link.err_ecc | report->link.err_crc | report->link.err_phy) != 0U)
  {
    printf("Link  : MARGINAL over %lu ms - ecc %lu uncorrectable / %lu corrected, "
           "crc %lu, dphy %lu\n",
           (unsigned long)report->link.window_ms,
           (unsigned long)report->link.err_ecc,
           (unsigned long)report->link.err_ecc_corrected,
           (unsigned long)report->link.err_crc,
           (unsigned long)report->link.err_phy);
    printf("        'refine' compares the neighbouring bitrate profiles;\n");
    printf("        an uncorrectable header ECC error changes the data type value.\n");
  }
  else
  {
    printf("Link  : clean over %lu ms, no ecc/crc/dphy errors\n",
           (unsigned long)report->link.window_ms);
  }

  for (uint32_t vc = 0U; vc < CSI_PROBE_VC_COUNT; vc++)
  {
    if (!info[vc].present)
    {
      continue;
    }

    printf("VC%lu   : %lu.%lu fps, DT 0x%02lx %s",
           (unsigned long)vc,
           (unsigned long)(info[vc].fps_x10 / 10U),
           (unsigned long)(info[vc].fps_x10 % 10U),
           (unsigned long)info[vc].image_dt,
           csi_probe_dt_name(info[vc].image_dt));

    if (info[vc].lines != 0U)
    {
      printf(", %lu lines, %lu bytes/line",
             (unsigned long)info[vc].lines, (unsigned long)info[vc].bytes_per_line);
    }
    if (info[vc].width != 0U)
    {
      printf(" -> %lux%lu", (unsigned long)info[vc].width, (unsigned long)info[vc].lines);
    }
    printf("\n");

    if (info[vc].image_dt_count == 0U)
    {
      printf("        no data type let data through - the one above is just the\n"
             "        one that rejected fewest packets, not a measurement\n");
    }
    else if (info[vc].dt_corrupt != 0U)
    {
      /* More than one data type was accepted into the datapath. Either the
         source really sends several, or the line/byte counter is not gated by
         the data type filter at all - the table printed by 'dt' tells the two
         apart, because in the second case every candidate accepts. */
      printf("        %lu other data type(s) also accepted:",
             (unsigned long)info[vc].dt_corrupt);
      for (uint32_t dt = 0U; dt < CSI_PROBE_DT_COUNT; dt++)
      {
        if (dt_seen(&info[vc], dt) && (dt != info[vc].image_dt))
        {
          printf(" 0x%02lx(%s)", (unsigned long)dt, csi_probe_dt_name(dt));
        }
      }
      printf("\n");
    }
  }

  printf("==========================\n\n");
}

void csi_probe_dump_status(void)
{
  uint32_t sr0  = CSI->SR0;
  uint32_t sr1  = CSI->SR1;
  uint32_t err1 = CSI->ERR1;
  uint32_t err2 = CSI->ERR2;

  printf("CSI SR0=0x%08lx SR1=0x%08lx ERR1=0x%08lx ERR2=0x%08lx\n",
         (unsigned long)sr0, (unsigned long)sr1,
         (unsigned long)err1, (unsigned long)err2);

  printf("  dphy:");
  if ((sr1 & CSI_SR1_ACTCLF)     != 0U) { printf(" clk-active"); }
  if ((sr1 & CSI_SR1_ACTDL0F)    != 0U) { printf(" l0-active"); }
  if ((sr1 & CSI_SR1_SYNCDL0F)   != 0U) { printf(" l0-sync"); }
  if ((sr1 & CSI_SR1_ACTDL1F)    != 0U) { printf(" l1-active"); }
  if ((sr1 & CSI_SR1_SYNCDL1F)   != 0U) { printf(" l1-sync"); }
  if ((sr1 & CSI_SR1_PHY_ERRORS) != 0U) { printf(" ERRORS(bitrate/skew?)"); }
  if (sr1 == 0U)                        { printf(" nothing on the lanes"); }
  printf("\n");

  printf("  vc  :");
  for (uint32_t vc = 0U; vc < CSI_PROBE_VC_COUNT; vc++)
  {
    if ((sr0 & (CSI_SR0_VC0STATEF << vc)) != 0U) { printf(" vc%lu-active", (unsigned long)vc); }
    if ((sr0 & (CSI_SR0_SOF0F << vc))     != 0U) { printf(" sof%lu", (unsigned long)vc); }
    if ((sr0 & (CSI_SR0_EOF0F << vc))     != 0U) { printf(" eof%lu", (unsigned long)vc); }
  }
  printf("\n");

  printf("  err :");
  if ((sr0 & CSI_SR0_SYNCERRF) != 0U)
  {
    printf(" sync(vc%lu)", (unsigned long)((err2 & CSI_ERR2_SYNCVCERR) >> CSI_ERR2_SYNCVCERR_Pos));
  }
  if ((sr0 & CSI_SR0_WDERRF) != 0U)
  {
    printf(" watchdog(vc%lu,no-data)", (unsigned long)((err2 & CSI_ERR2_WDVCERR) >> CSI_ERR2_WDVCERR_Pos));
  }
  if ((sr0 & CSI_SR0_SPKTERRF) != 0U)
  {
    printf(" short-packet(dt0x%02lx)", (unsigned long)((err2 & CSI_ERR2_SPKTDTERR) >> CSI_ERR2_SPKTDTERR_Pos));
  }
  if ((sr0 & CSI_SR0_IDERRF) != 0U)
  {
    printf(" unfiltered-dt(vc%lu,dt0x%02lx)",
           (unsigned long)((err1 & CSI_ERR1_IDVCERR) >> CSI_ERR1_IDVCERR_Pos),
           (unsigned long)((err1 & CSI_ERR1_IDDTERR) >> CSI_ERR1_IDDTERR_Pos));
  }
  if ((sr0 & CSI_SR0_CRCERRF) != 0U)
  {
    printf(" crc(dt0x%02lx)", (unsigned long)((err1 & CSI_ERR1_CRCDTERR) >> CSI_ERR1_CRCDTERR_Pos));
  }
  if ((sr0 & CSI_SR0_ECCERRF) != 0U)
  {
    printf(" ecc-uncorrectable");
  }
  if ((sr0 & CSI_SR0_CECCERRF) != 0U)
  {
    printf(" ecc-corrected(dt0x%02lx)", (unsigned long)((err1 & CSI_ERR1_CECCDTERR) >> CSI_ERR1_CECCDTERR_Pos));
  }
  if ((sr0 & (CSI_SR0_LINK_ERRORS | CSI_SR0_CECCERRF | CSI_SR0_IDERRF)) == 0U)
  {
    printf(" none");
  }
  printf("\n");

  /* Flag-clear registers mirror the status bit positions. */
  CSI->FCR0 = sr0;
  CSI->FCR1 = sr1;
}
